CORE/Source/libs/indy10/Demos/soap/dunit/SoapSamples/LookyBook.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soap:Body>
      <GetInfo xmlns="http://dinoch.dyndns.org/webservices/">
         <ISBN>0060652942</ISBN>
      </GetInfo>
   </soap:Body>
</soap:Envelope>